C06-rspecbook/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" ORDER BY lastname, firstname
---
  def index
    if params[:letter]
      @contacts = Contact.by_letter(params[:letter])
    else
      @contacts = Contact.order('lastname, firstname')