C07-marketplace-api/app/controllers/concerns/authenticable.rb

  def current_user
    @current_user ||= User.find_by(auth_token: request.headers['Authorization'])
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT ?  [["auth_token", "ZHX8jX4N2xsokJHj5eUE"], ["LIMIT", 1]]