C07-marketplace-api/app/controllers/api/v1/orders_controller.rb

  def create
    # order = current_user.orders.build(order_params)
    order = current_user.orders.build
    order.build_placements_with_product_ids_and_quantities(params[:order][:product_ids_and_quantities])
    if order.save
---
INSERT INTO "orders" ("user_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["total", 110.9159911736881], ["created_at", "2019-02-18 07:43:04.008373"], ["updated_at", "2019-02-18 07:43:04.008373"]]
INSERT INTO "placements" ("order_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["order_id", 2], ["product_id", 20], ["created_at", "2019-02-18 07:43:04.010852"], ["updated_at", "2019-02-18 07:43:04.010852"]]