C07-marketplace-api/app/controllers/api/v1/products_controller.rb

  def index
    #products = params[:product_ids].present? ? Product.find(params[:product_ids]) : Product.all
    #render json: products, status: :ok
    # render json: Product.search(params), status: :ok
    products = Product.search(params).page(params[:page]).per(params[:per_page])
---
SELECT COUNT(*) FROM "products"
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    product = current_user.products.build(product_params)
    if product.save
---
INSERT INTO "products" ("title", "price", "published", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Sonic Master"], ["price", 23.0], ["published", 1], ["user_id", 1], ["created_at", "2019-02-18 07:18:30.031107"], ["updated_at", "2019-02-18 07:18:30.031107"]]