C07-marketplace-api/app/controllers/api/v1/users_controller.rb

  def show
    render json: User.find(params[:id]), status: :ok
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    # user = User.find(params[:id])
    user = current_user
    if user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "x@y.com"], ["updated_at", "2019-01-21 05:41:01.084026"], ["id", 2]]