C07-marketplace-api/app/serializers/user_serializer.rb

  def product_ids
    object.products.pluck(:id)
---
SELECT "products"."id" FROM "products" WHERE "products"."user_id" = ?  [["user_id", 1]]